#+STARTUP: content

** Lisp Lists
This is a Lisp list:
#+begin_src emacs-lisp
  '(rose
    violet
    daisy
    buttercup)
#+end_src

#+RESULTS:
| rose | violet | daisy | buttercup |

*** Numbers, List inside Lists
Here is another list, this time with a list inside of it:
#+begin_src emacs-lisp
  '(this list has (a list inside of it))
#+end_src

#+RESULTS:
| this | list | has | (a list inside of it) |

*** Lisp Atoms
The empty list, ‘()’, is considered both an atom and a list at the same time.
“Symbolic expressions” or, more concisely, “s-expressions”, are the printed
representation of both atoms and lists.  Also, the word “form” can be used as a
synonym for expression.

Atoms are indivisible semantic units.  Numbers and symbols are examples of
atoms.  Text betwen double quotation marks (even sentences or paragraphs) is
also an atom.  Here is an example:
#+begin_src emacs-lisp
  '(this list includes "text between quotation marks.")
#+end_src

#+RESULTS:
| this | list | includes | text between quotation marks. |

This kind of atom is called a “string” (for “string of characters”).

** Run a Program
The Lisp interpreter will evaluate a list unless it is preceded by a quote
(‘'’).  If quoted, the list is returned as is:

#+begin_src emacs-lisp
  '(this is a quoted list)
#+end_src

#+RESULTS:
| this | is | a | quoted | list |

If unquoted, the interpreter will take the first item of the list as a function
to execute, with the remaining elements of the list taken as arguments:

#+begin_src emacs-lisp
  (+ 2 2)
#+end_src

#+RESULTS:
: 4

*** Evaluating Inner Lists
In nested lists, the innermost list is evaluated first and its returning value
is passed to the enclosing list.  The outer expressions are then successively
evaluated (if any), up to the outermost list:

#+begin_src emacs-lisp
  (+ 2 (+ 3 3))
#+end_src

#+RESULTS:
: 8

*** fill-column example
In order to find the value attached to a variable, one needs to evaluate its
symbol:

#+begin_src emacs-lisp
fill-column
#+end_src

#+RESULTS:
: 80

*** An Argument as the Value of a Variable or List
An argument can be a symbol that returns a value when it is evaluated.  For
example, when the symbol ‘fill-column’ by itself is evaluated, it returns a
number.  This number can be used in an addition:

#+begin_src emacs-lisp
  (+ 2 fill-column)
#+end_src

#+RESULTS:
: 82

In addition, an argument can be a list that returns a value when it is
evaluated:

#+begin_src emacs-lisp
  (concat "The " (number-to-string (+ 2 fill-column)) " red foxes.")
#+end_src

#+RESULTS:
: The 82 red foxes.

*** The ‘message’ function
The ‘message’ function takes a variable number of arguments and is used to post
messages in the echo aread to the user:

#+begin_src emacs-lisp
  (message "This message appears in the echo area!")
#+end_src

#+RESULTS:
: This message appears in the echo area!

The format control strings ‘%s’ and ‘%d’ in the quoted string of characters are
replaced in the returned message respectively by string and integer arguments,
in the order that they appear in the argument list passed to the function:

#+begin_src emacs-lisp
  (message "The name of this buffer is: %s." (buffer-name))
#+end_src

#+RESULTS:
: The name of this buffer is: eintr.org.

#+begin_src emacs-lisp
  (message "The value of fill-column is: %d." fill-column)
#+end_src

#+RESULTS:
: The value of fill-column is: 80.

Here are two more complex examples:

#+begin_src emacs-lisp
  (message "There are %d %s in the office!"
           (- fill-column 14) "pink elephants")
#+end_src

#+RESULTS:
: There are 66 pink elephants in the office!

#+begin_src emacs-lisp
  (message "He saw %d %s"
           (- fill-column 32)
           (concat "red "
                   (substring
                    "The quick brown foxes jumped." 16 21)
                   " leaping."))
#+end_src

#+RESULTS:
: He saw 48 red foxes leaping.

*** Using set
When evaluated, the following expression will set the value of the symbol
‘flowers’ to the list ‘'(rose violet daisy buttercup)’:

#+begin_src emacs-lisp
  (set 'flowers '(rose violet daisy buttercup))
#+end_src

#+RESULTS:
| rose | violet | daisy | buttercup |

This happens as a side effect of returning the list itself.  Once set,
evaluating the symbol flowers will return the list it was assigned:

#+begin_src emacs-lisp
  flowers
#+end_src

#+RESULTS:
| rose | violet | daisy | buttercup |

However, evaluating the quoted symbol ‘'flowers’ will return the symbol itself:

#+begin_src emacs-lisp
  'flowers
#+end_src

#+RESULTS:
: flowers

*** Using setq
The special form ‘setq’ behaves like ‘set’ except that the first argument is
quoted automatically:

#+begin_src emacs-lisp
  (setq carnivores '(lion tiger leopard))
#+end_src

#+RESULTS:
| lion | tiger | leopard |

In addition, setq allows for the binding of several symbol/value pairs within
the same expression, by having each even argument bound to the preceding odd
symbol:

#+begin_src emacs-lisp
  (setq trees '(pine fir oak maple)
        herbivores '(gazelle antelope zebra))
#+end_src

#+RESULTS:
| gazelle | antelope | zebra |

*** Effect of Installation
Installing a function makes it available for use within Emacs.  The following
can now be evaluated:

#+begin_src emacs-lisp
  (multiply-by-seven 3) ; 21
#+end_src

#+RESULTS:
: 21

The documentation of a function definition can be inquired by invoking the
‘describe-function’ (‘C-h f’) command.

*** Sample let Expression
The following expression creates and gives initial values to the two variables
‘zebra’ and ‘tiger’.  The body of the ‘let’ expression is a list which calls the
‘message’ function:

#+begin_src emacs-lisp
  (let ((zebra "stripes")
        (tiger "fierce"))
    (message "One kind of animal has %s and another is %s."
             zebra tiger))
#+end_src

#+RESULTS:
: One kind of animal has stripes and another is fierce.

*** Uninitialized let Variables
If you do not bind the variables of a ‘let’ statement to specific initial
values, they will automatically be bound to an initial value of ‘nil’, as in the
following expression:

#+begin_src emacs-lisp
  (let ((birch 3)
        pine
        fir
        (oak 'some))
    (message
     "Here are %d variables with %s, %s, and %s value."
     birch pine fir oak))
#+end_src

#+RESULTS:
: Here are 3 variables with nil, nil, and some value.

*** if in more detail
An ‘if’ expression written in Lisp does not use the word “then”; the test and
the action are the second and third elements of the list whose first element is
‘if’.  Nonetheless, the test part of an ‘if’ expression is often called the
“if-part” and the second argument is often called the “then-part”.

Also, when an ‘if’ expression is written, the true-or-false-test is usually
written on the same line as the symbol ‘if’, but the action to carry out if the
test is true, the then-part, is written on the second and subsequent lines.
This makes the ‘if’ expression easier to read:

#+begin_src emacs-lisp
  (if TRUE-OR-FALSE-TEST
      ACTION-TO-CARRY-OUT-IF-TEST-IS-TRUE)
#+end_src

Here is an example:

#+begin_src emacs-lisp
  (if (> 5 4)                           ; if-part
  (message "Five is greater than four!")) ; then-part
#+end_src

#+RESULTS:
: Five is greater than four!

And a more realistic example:

#+begin_src emacs-lisp
  (defun type-of-animal (characteristic)
    "Print message in echo area depending on CHARACTERISTIC.
  If the CHARACTERISTIC is the string \"fierce\",
 then warn of a tiger."
    (if (equal characteristic "fierce")
        (message "It is a tiger!")))

  (type-of-animal "fierce")"It is a tiger!"
  (type-of-animal "striped")
#+end_src

** else
An ‘if’ expression may have an optional third argument, called the “else-part”,
for the case when the true-or-false-test returns false.  When this happens, the
second argument or then-part of the overall ‘if’ expression is /not/ evaluated,
but the third or else-part /is/ evaluated.

In the written Lisp, the else-part is usually written to start on a line of its
own and is indented less than the then-part:

#+begin_src emacs-lisp
  (if TRUE-OR-FALSE-TEST
         ACTION-TO-CARRY-OUT-IF-THE-TEST-RETURNS-TRUE
       ACTION-TO-CARRY-OUT-IF-THE-TEST-RETURNS-FALSE)
#+end_src

Here is an example:

#+begin_src emacs-lisp
  (if (> 4 5)                        ; if-part
      (message "Four falsely greater than five!") ; then-part
      (message "Four is not greater than five!"))   ; else-part
#+end_src

#+RESULTS:
: Four is not greater than five!

And a more elaborated example with the ‘type-of-animal’ function:

#+begin_src emacs-lisp
  (defun type-of-animal (characteristic)  ; Second version.
    "Print message in echo area depending on CHARACTERISTIC.
  If the CHARACTERISTIC is the string \"fierce\",
  then warn of a tiger; else say it is not fierce."
    (if (equal characteristic "fierce")
        (message "It is a tiger!")
      (message "It is not fierce!")))

  (type-of-animal "fierce")"It is a tiger!"
  (type-of-animal "striped")"It is not fierce!"
#+end_src

*** ‘save-excursion’
Record the values of point and the current buffer before evaluating the body of
this special form.  Restore the value of point and buffer afterwards.

For example,

#+begin_src emacs-lisp
  (message "We are %d characters into this buffer."
           (- (point)
              (save-excursion
                (goto-char (point-min))
                (point))))
#+end_src

#+RESULTS:
: We are 39114 characters into this buffer.

** ‘car’ and ‘cdr’
The CAR of a list is the first element of that list.  Thus the CAR of the list
‘'(rose violet daisy buttercup)’ is ‘rose’:

#+begin_src emacs-lisp
  (car '(rose violet daisy buttercup)) ; rose
#+end_src

#+RESULTS:
: rose

The CDR of a list is the /rest/ of the list (i.e., anything /beyond/ its first
element).  Thus, while the CAR of the list ‘'(rose violet daisy buttercup)’ is
‘rose’, the rest of the list, the value returned by the ‘cdr’ function, is
‘'(violet daisy buttercup)’:

#+begin_src emacs-lisp
  (cdr '(rose violet daisy buttercup)) ;; (violet daisy buttercup)
#+end_src

#+RESULTS:
| violet | daisy | buttercup |

Both ‘car’ and ‘cdr’ are “non-destructive”: they do not change the object to
which they apply.

When undertaking a list of lists, car will return the first element of its
argument, itslef a list:

#+begin_src emacs-lisp
  (car '((lion tiger cheetah)
         (gazelle antelope zebra)
         (whale dolphin seal))) ;; (lion tiger cheetah)
#+end_src

#+RESULTS:
| lion | tiger | cheetah |

In the example above, the rest of the list would be a list of lists as
well:

#+begin_src emacs-lisp
  (cdr '((lion tiger cheetah)
         (gazelle antelope zebra)
         (whale dolphin seal)))  ;; ((gazelle antelope zebra) (whale dolphin seal))
#+end_src

#+RESULTS:
| gazelle | antelope | zebra |
| whale   | dolphin  | seal  |

** ‘cons’
The ‘cons’ function constructs lists; it performs the reverse operation of ‘car’
and ‘cdr’.  For example, ‘cons’ can be used to make a four element list from the
three element list, ‘'(fir oak, maple)’:

#+begin_src emacs-lisp
  (cons 'pine '(fir oak maple)) ;; (pine fir oak maple)
#+end_src

#+RESULTS:
| pine | fir | oak | maple |

Just like ‘car’ and ‘cdr’, ‘cons’ is non-destructive: the original list is /not/
modified; rather, a /new/ one is constructed.

*** Find the Length of a List: ‘length’
The number of elements of a list can be found by using the Lisp function
‘length’:

#+begin_src emacs-lisp
  (length '(buttercup)) ; 1
  (length '(daisy buttercup)) ; 2
  (length (cons 'violet '(daisy buttercup))) ; 3
#+end_src

‘length’ will also return the number of elements in the empty list:

#+begin_src emacs-lisp
  (length ()) ; 0
#+end_src

#+RESULTS:
: 0

**** How macros work
This section was taken from [[https://lispcookbook.github.io/cl-cookbook/macros.html][The Common Lisp Cookbook]].

In computer science, the word “macro” is used to mean a syntatic extension to a
programming language.  A macro is an ordinary piece of Lisp code that operates
on /another piece of putative Lisp code/, translating it into (a version closer
to) executable Lisp code.

Let’s work out an example.  Suppose we want a version of ‘setq’ (‘setq2’) that
sets two variables to the same value, such that the expression:

#+begin_src emacs-lisp
  (setq2 v1 v2 e)
#+end_src

binds the result of evaluating the form ‘e’ to the symbols ‘v1’ and ‘v2’.  The
problem with defining such a function is that there is no way to tell the
interpreter which variables are supposed to be set.  What we aim for is to have
the interpreter expanding that form into:

#+begin_src emacs-lisp
  (progn
    (setq v1 e)
    (setq v2 e))
#+end_src

A macro allows us to achieve precisely this, by specifying a program for
transforming the input pattern ~(setq2 v1 v2 e)~ into the output pattern ~(progn
…)~.  Here is a definition of the ‘setq2’ macro:

#+begin_src emacs-lisp
  (defmacro setq2 (v1 v2 e)
    (list 'progn
          (list 'setq v1 e)
          (list 'setq v2 e)))
#+end_src

Then it returns a piece of code.  In Lisp, because code is represented as lists,
we can simply return a list that /represents/ code.

Each /quoted/ symbol evaluates to itself, i.e., it is returned as is:

+ ~(quote foo bar baz)~ returns ~(foo bar baz)~.
+ The quote character, ~'~, is a shortcut to ~quote~, a /special operator/.
+ So, ~'foo~ evaluates to ~foo~.

So, our macro returns:

+ The symbol ~progn~;
+ A second list, that contains:
  - The symbol ~setq~;
  - The variable ~v1~ (note that the variable is /not/ evaluated inside the
    macro); and
  - The expression ~e~ (not evaluated either).
+ A third list, which mirrors the second for the variable ~v2~.

To check what code a macro would expand to, use the function ‘macroexpand’:

#+begin_src emacs-lisp
  (macroexpand '(setq2 v1 v2 3))
#+end_src

#+RESULTS:
| progn | (setq v1 3) | (setq v2 3) |

More interestingly:

#+begin_src emacs-lisp
  (macroexpand '(setq2 v1 v2 (+ z 3)))
#+end_src

#+RESULTS:
| progn | (setq v1 (+ z 3)) | (setq v2 (+ z 3)) |
** ‘length-list-file’ in Detail
Here’s the function tasked with finding a file, ensuring that the point is
located at the beginning of the file, moving point forward defun by defun, and
retrieving the count of words and symbols in each defun:

#+begin_src emacs-lisp
  (defun lengths-list-file (filename)
    "Return list of definitions' lengths within file FILENAME.
  The returned list is a list of numbers.  Each number is the
  number of words or symbols in one function definition."
    (message "Working on `%s' ... " filename)
    (save-excursion
      (let ((buffer (find-file-noselect filename))
            (lengths-list))
        (set-buffer buffer)
        (setq buffer-read-only t)
        (widen)
        (goto-char (point-min))
        (while (re-search-forward "^(defun" nil t)
          (setq lengths-list
                (cons (count-words-in-defun) lengths-list)))
        (kill-buffer buffer)
        lengths-list)))
#+end_src

Here we run the function to count the number of words and symbols in each of the
defuns included in the file debug.el.gz from the 26.3 GNU Emacs distribution:

#+begin_src emacs-lisp
  (lengths-list-file
   "/usr/share/emacs/26.3/lisp/emacs-lisp/debug.el.gz")
#+end_src

#+RESULTS:
| 76 | 26 | 135 | 33 | 112 | 78 | 24 | 155 | 33 | 94 | 44 | 18 | 38 | 41 | 41 | 18 | 72 | 24 | 38 | 38 | 110 | 26 | 29 | 100 | 49 | 42 | 304 | 149 | 476 |

** Recursively Count Words in Different Files
Following is the recursive version of ‘lengths-list-many-files’:

#+begin_src emacs-lisp
  (defun recursive-lengths-list-many-files (list-of-files)
    "Return list of lengths of each defun on LIST-OF-FILES."
    (if list-of-files
        (append
         (lengths-list-file
          (expand-file-name (car list-of-files)))
         (recursive-lengths-list-many-files
          (cdr list-of-files)))))
#+end_src

To test the function, we can evaluate the following code:

#+begin_src emacs-lisp
  (cd "/usr/share/emacs/26.3/")

  (recursive-lengths-list-many-files
   '("./lisp/macros.el.gz"
     "./lisp/mail/mailalias.el.gz"
     "./lisp/makesum.el.gz"))
#+end_src

#+RESULTS:
| 263 | 248 | 387 | 87 | 38 | 35 | 32 | 87 | 175 | 84 | 69 | 90 | 421 | 212 | 336 | 82 | 181 |

*** Sorting Lists
The ‘sort’ function takes two arguments, (1) the list to be sorted and (2) a
predicate that determines whether the first of two list elements is less than
the second.

Typically, the ‘<’ function is used when sorting a numeric list.  For example,

#+begin_src emacs-lisp
  (sort '(4 8 21 17 33 7 21 7) '<)
#+end_src

Produces the following:

#+RESULTS:
| 4 | 7 | 7 | 8 | 17 | 21 | 21 | 33 |

(Note that, in this example, both arguments are quoted so that the symbols are
not evaluated before being passed to ‘sort’ as arguments.)

Sorting the list returned by the ‘recursive-lengths-list-many-files’ function is
straightforward; it uses the ‘<’ function:

#+begin_src emacs-lisp
  (cd "/usr/share/emacs/26.3/")

  (sort
   (recursive-lengths-list-many-files
    '("./lisp/macros.el.gz"
      "./lisp/mail/mailalias.el.gz"
      "./lisp/makesum.el.gz"))
   '<)
#+end_src

#+RESULTS:
| 32 | 35 | 38 | 69 | 82 | 84 | 87 | 87 | 90 | 175 | 181 | 212 | 248 | 263 | 336 | 387 | 421 |

*** Making a List of Files
We now need a function to extract all the source files living within a
directory.  We thus aim to create a function that will enable us to feed
filenames to ‘recursive-lengths-list-many-files’ as a list that looks like this:

#+begin_src emacs-lisp
  ("./lisp/macros.el.gz"
   "./lisp/mail/rmail.el.gz"
   "./lisp/makesum.el.gz")
#+end_src

This ‘files-in-below-directory’ function must accomplish the following:

  + Check to see whether it is looking at a filename that ends in ~.el.gz~; and
    if so, add its name to a list.

  + Check to see whether it is looking at a filename that is the name of a
    directory; and if so,
    
    - Check to see whether it is looking at ~.~ or ~..~; and if so, skip it.
      
    - Or else, move into that directory and repeat the process.

Here is the function:

#+begin_src emacs-lisp
  (defun files-in-below-directory (directory)
    "List the `.el.gz' files in DIRECTORY and its sub-directories."
    ;; Although the function will be used non-interactively, it will be easier to
    ;; test if we make it interactive.  The directory will have a name such as
    ;; "/usr/local/share/emacs/26.3/lisp".
    (interactive "DDirectory name: ")
    (let (el-files-list
          (current-directory-list
           (directory-files-and-attributes directory t)))
      ;; while we are in the current directory
      (while current-directory-list
        (cond
         ;; check to see whether filename ends in `el.gz' and, if so, add its name
         ;; to a list.
         ((equal ".el.gz" (substring (car (car current-directory-list)) -6))
          (setq el-files-list
                (cons (car (car current-directory-list)) el-files-list)))
         ;; check whether filename is that of a directory
         ((eq t (car (cdr (car current-directory-list))))
          ;; decide whether to skip or recurse
          (if
              (equal "."
                     (substring (car (car current-directory-list)) -1))
              ;; then do nothing since filename is that of current or parent
              ;; directory, "." or ".."
              nil
            ;; else descend into the directory and repeat the process
            (setq el-files-list
                  (append
                   (files-in-below-directory
                    (car (car current-directory-list)))
                   el-files-list)))))
        ;; move to the next filename in the list; this also shortens the list so
        ;; the while loop eventually comes to an end
        (setq current-directory-list (cdr current-directory-list)))
      ;; return the filenames
      el-files-list))
#+end_src

We can test the function by feeding it the base directory of all ~.el.gz~ source
files in Emacs’s system installation:

#+begin_src emacs-lisp
  (length
   (files-in-below-directory "/usr/share/emacs/26.3/lisp"))
#+end_src

#+RESULTS:
: 1461

*** Counting Function Definitions 
The bins are defined by the list ‘top-of-ranges’ as follows:

#+begin_src emacs-lisp
     (defvar top-of-ranges
      '(10  20  30  40  50
        60  70  80  90 100
       110 120 130 140 150
       160 170 180 190 200
       210 220 230 240 250
       260 270 280 290 300)
      "List specifying ranges for `defuns-per-range'.")
#+end_src

To parse the number of length observations in each bin, we will deploy the
‘defuns-per-range’ function:

#+begin_src emacs-lisp
  (defun defuns-per-range (sorted-lengths top-of-ranges)
    "SORTED-LENGTHS defuns in each TOP-OF-RANGES ranges."
    (let ((top-of-range (car top-of-ranges))
          (number-within-range 0)
          defuns-per-range-list)

      ;; Outer loop
      (while top-of-ranges

        ;; Inner loop
        (while (and
                ;; Need number for numeric test
                (car sorted-lengths)
                (< (car sorted-lengths) top-of-range))

          ;; Count number of definitions within current range
          (setq number-within-range (1+ number-within-range))
          (setq sorted-lengths (cdr sorted-lengths)))

        ;; Exit inner loop but remain within outer loop

        (setq defuns-per-range-list
              (cons number-within-range defuns-per-range-list))
        (setq number-within-range 0)      ; Reset count to zero

        ;; Move to next range
        (setq top-of-ranges (cdr top-of-ranges))
        ;; Specify next top of range value
        (setq top-of-range (car top-of-ranges)))

      ;; Exit outer loop and count the number of defuns larger the largest
      ;; `top-of-range' value
      (setq defuns-per-range-list
            (cons
             (length sorted-lengths)
             defuns-per-range-list))

      ;; Return a list of the number of definitions within each range, smallest to
      ;; largest
      (nreverse defuns-per-range-list)))
#+end_src

We can test the function by evaluating the following code:

#+begin_src emacs-lisp
  ;; (Shorter list than we will use later.)
  (setq top-of-ranges
        '(110 120 130 140 150
              160 170 180 190 200))

  (setq sorted-lengths
        '(85 86 110 116 122 129 154 176 179 200 265 300 300))

  (defuns-per-range sorted-lengths top-of-ranges)
#+end_src

#+RESULTS:
| 2 | 2 | 2 | 0 | 0 | 1 | 0 | 2 | 0 | 0 | 4 |
